
menu_main = {1: 'Работа с сотрудниками',
            2: 'Работа со справочниками',
            3: 'Экспорт БД',
            4: 'Выход'}

menu_person = {1: 'Добавить сотрудника',
            2: 'Изменить данные сотрудника',
            3: 'Удалить сотрудника',
            4: 'Просмотреть сотрудников',
            5: 'Поиск сотрудника',
            6: 'Посмотреть свод по сотрудникам',
            7: 'Выход'}

menu_sprav = {1: 'Работа со справочником Должностей',
            2: 'Работа со справочником Подразделений',
            3: 'Работа со справочником Организаций',
            4: 'Выход'}

menu_sprav_job = {1: 'Просмотреть должности',
                  2: 'Добавить должность',
                  3: 'Изменить должность',
                  4: 'Выход'}

menu_sprav_department = {1: 'Просмотреть Подразделения',
                        2: 'Добавить Подразделения',
                        3: 'Изменить Подразделения',
                        4: 'Выход'}

menu_sprav_company = {1: 'Просмотреть Организацию',
                    2: 'Добавить Организацию',
                    3: 'Выход'}

menu_export = {1: 'Экспорт Сотрудников',
            2: 'Экспорт справочника Организаций',
            3: 'Экспорт справочника Подразделений',
            4: 'Экспорт справочника Должностей',
            5: 'Экспорт сводной таблицы по сотрудникам',
            6: 'Выход'}