'''
2. Напишите программу, которая определит позицию второго вхождения строки
в списке либо сообщит, что её нет.

Пример:
список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
список: [], ищем: "123", ответ: -1
'''

def find_str_sp(sp, line, num_pos):
    for i in range(0,len(sp)):
        if line == sp[i]:
            num_pos -= 1
            if num_pos == 0:
                return i
    return -1

if __name__ == '__main__':
    #sp = ["qwe", "asd", "zxc", "qwe", "ertqwe"]
    #sp = ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"]
    sp = ["йцу", "фыв", "ячс", "цук", "йцукен"]
    #sp = ["123", "234", 123, "567"]
    #sp = []
    line = input('Введите строку для поиска второго вхождения в списке: ')
    print('список: {}, ищем: {}, ответ: {}'.format(sp, line, find_str_sp(sp, line, 2)))
