'''
Напишите проамму, которая принимает на вход число N и выдает набор произведений чисел от 1 до N/
Пример:
пусть N 4: тогда [1, 2, 6, 24] (1, 1*2, 1*2*3, 1*1*3*4)
'''

def multiply_numbers
if __name__ == '__main__':
    try:
        str_num = input('Введите целое число ')
        num = int(str_num)
        print(f'- {str_num} -> ', summ_digits_str(str_num))
    except:
        print('Введите целое число!')
